graph main_graph (
  %input.1[INT16, 1x45x45x1], exponents: [-15]
) initializers (
  %conv3.bias[INT32, 64]
  %fc1.weight[INT16, 1x1x576x128]
  %fc2.weight[INT16, 1x1x128x8]
  %fc2.bias[INT32, 8]
  %conv1.weight[INT16, 3x3x1x64]
  %conv3.weight[INT16, 3x3x64x64]
  %conv1.bias[INT32, 64]
  %fc1.bias[INT32, 128]
  %conv2.bias[INT32, 64]
  %conv2.weight[INT16, 3x3x64x64]
) {
  %/Relu_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [1, 1]](%input.1, %conv1.weight, %conv1.bias)
  %/pool/MaxPool_output_0 = MaxPool[ceil_mode = 0, dilations = [1, 1], kernel_shape = [2, 2], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [2, 2]](%/Relu_output_0)
  %/Relu_1_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [1, 1]](%/pool/MaxPool_output_0, %conv2.weight, %conv2.bias)
  %/pool_1/MaxPool_output_0 = MaxPool[ceil_mode = 0, dilations = [1, 1], kernel_shape = [2, 2], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [2, 2]](%/Relu_1_output_0)
  %/Relu_2_output_0 = Conv[activation = 'Relu', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [1, 1]](%/pool_1/MaxPool_output_0, %conv3.weight, %conv3.bias)
  %/pool_2/MaxPool_output_0 = MaxPool[ceil_mode = 0, dilations = [1, 1], kernel_shape = [2, 2], pads = [0, 0, 0, 0], quant_type = 'S16', strides = [2, 2]](%/Relu_2_output_0)
  %PPQ_Variable_0 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S16'](%/pool_2/MaxPool_output_0)
  %/Flatten_output_0 = Flatten[axis = 1, quant_type = 'S16'](%PPQ_Variable_0)
  %/Relu_3_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S16', transB = 0](%/Flatten_output_0, %fc1.weight, %fc1.bias)
  %23 = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S16', transB = 0](%/Relu_3_output_0, %fc2.weight, %fc2.bias)
  return %23
}


initializers value:
%conv3.bias, shape: [64], exponents: [-29], docString: b'layout ==> UNK', 
value: array([ 18327810,  14252598,   8592242,  -6770322,   7050973,    264634,
       -10582220,  -8187764, -25859854, -15493488,  13273202, -14417012,
       -22605850, -17168248,  12953562,   5091418,  10639256,   1843264,
         8525420,  21343886,  30063504,  30494870,  14033428,  17273298,
        -1919278,    251619, -15089284, -15769472, -25769850,  18427334,
        -2636427,  21839766,  10600600,  -6145955,   4322398,   2877194,
        20785068,   2183332, -10540524,     -8734, -20141900, -20940988,
         2170398, -14881390, -11189118, -19442776,  12532188,   2571274,
         9894516, -10627636,  29246988, -24068714, -22887698, -25087438,
        14712408,  33083320,  29858628,   2430138,  11271924, -19368638,
       -17697920, -10036502,   4596257,  18831866])
%fc1.weight, shape: [1, 1, 576, 128], exponents: [-17], docString: b'layout ==> N8HWC8', 
value: array([ -5535,  -1501,  -4476,  -5352,   1231,   5482,   1900,   1796,
        -1682,   3342,   3703,  -1681,   -683,    838,   -344,   2676,
          198,   5534,   2794,   -276,  -4101,   5884,   4130,   1601,
          338,   5209,   2348,   3577,  -5918,   -781,  -1985,   -946,
         1804,   5182,   2376,   3579,  -3898,    498,  -3415,   -252,
        -4087,    692,   -414,   2306,   -633,   1758,  -4767,  -5432,
         5025,   5138,  -6040,  -7318,   -196,   -273,   -702,  -2363,
         4928,   4302,  -3000,   1836,  -6755,   3374,  -3744,  -4853,
         -424,   2222,  -1456,   -904,  -3964,   3350,  -6050,  -3943,
         3172,   1190,   -131,  -8262,  -3576,  -2456,    372,  -4657,
        -3217,   -427,  -1078,   4399,  -6104,  -3305,   1692,   3102,
        -1042,   -690,   2164,   2439,   3120,    700,   1262,  -5454,
         4057,   2582,   5064,   5580,   3957,  -4683,   3769,  -1629,
        -3835,  -2253,   6468,   3865,   -684,  -6268,  -3390,   -196,
         -159,   5007,  -1849,   3531,   3274,  -3067,     38,  -1603,
        -2314,   6550,   -419,  -1943,   1448,   1798,   -889,  -3354,
        -5225,   5877,   2060,  -4313,  -1418,   -484,     67,    686,
         1799,  -3936,   5026,     84,   1787,   3352,   1193,  -3147,
          699,   3721,     -6,  -2598,  -4878,  -3772,  -3198,  -4114,
         7956,   -145,   5466,   3278,  -5334,   2287,  -4110,  -5495,
         1601,   4465,  -3173,  -3515,   3804,   2111,    -36,   4673,
        -2973,   2296,  -1601,   2614,    453,   1158,  -5421,   1493,
        -2959,  -4932,   4091,   3230,  -4835,  -3348,  -1879,   2322,
         -885,  -2212,   3643,   -681,  -3853,    703,  -2856,  -1984,
         1727,   5939,   4052,   1686,   3564,  -1570,   2048,   4262,
        -2416,   -638,  -4140,  -4266,  -3214,   5375,   3840,    -60,
        -3267,   -482,  -5114,   5521,   4824,   -611,  -1090,   1729,
         -687,  -4223,  -2290,   3668,   -429,  -2008,   2950,  -1011,
         1347,  -6169,  -1940,   2926,   2141,   5859,   3079,    136,
         2897,  -1227,  -9008,   3298,  -4218,   2986,  -6080,  -4889,
         -644,  -2163,   4781,   -309,   1525,   2531,   -906,  -5101,
         2026,   1531,   1332,  -3965,   4069,    100,  -1231,   1845,
        -2820,  -3894,  -5446,  -5934,   2616,   -174,    545,   4892,
        -6279,  -4338,   3004,    787,  -1962,   1280,   1610,   4306,
        -6040,  -2751,   4129,   1117,  -1737,  -2783,   -774,   1711,
        -4860,  -2131,   3481,    204,  -5793,  -1795,   1499,  -2226,
        -6693,   5728,  -5524,   -993,   1021,  -3254,  -2257,  -1289,
        -5821,   1945,   5982,   1804,  -5609,  -5671,  -4416,  -5811,
         -880,  -1656,  -5065,  -6304,   1142,  -3461,   1949,  -5443,
        -2462,   5596,   -699,     48,  -5046,  -6034,  -3194,  -1390,
         2871,   1660,    641,   5295,  -4804,  -4704,   1846,   1777,
         3684,    601,    848,   4131,    761,  -3713,    198,   4713,
        -7109,  -1412,   1975,  -4133,  -2912,  -2176,    185,  -3185,
        -3164,   -699,   5527,   3221,  -4027,   3394,  -3976,  -1218,
        -3540,   2143,   -212,  -1922,  -6292,    787,   4206,   1857,
        -1156,   1916,   1110,  -1349,  -4298,  -2012,  -4301,   5019,
         -930,   3350,   1605,   1873,   4414,  -5208,  -1637,  -4160,
         2570,   3035,   1437,   2753,   3381,  -1959,   2416,  -4228,
        -4335,   4987,  -3707,  -4633,   2371,    478,   1811,   3284,
         1911,  -5220,    533,    677,    483,   -167,  -2213,   4135,
        -3545,   2955,  -1447,   3237,   -647,   1697,  -5221,   1246,
         3294,   1595,  -4898,   3725,   1072,   -671,   1439,   2262,
         -471,  -1636,    208,  -1045,  -1214,  -4011,   -895,   4739,
        -5387,   2308,  -1048,   1545,  -5162,    141,  -5011,    -73,
        -5039,  -1895,   3487,   3281,    426,   3154,  -3457,   2526,
         -985,   4636,  -2612,   3169,   1424,   3902,   1271,  -2447,
          325,   4775,  -6354,  -5240,   1678,  -4654,  -3513,    377,
        -5342,  -3049,   4394,  -6465,   2251,   3976,  -4634,  -4797,
        -3748,  -2457,   -599,   4651,  -5276,  -3292,   -823,  -3759,
         5154,  -1447,   -773,  -1551,  -2395,   2512,   -718,  -5488,
        -4155,  -1857,   1656,  -5199,  -2601,  -5842,    305,   1528,
        -4274,  -4562,  -1331,   -976,   2809,   1641,   4503,  -5513,
       -11883,  -3878,  -1290,   6400,  -2617,   5699,   2675,   -221,
        -1911,   -852,  -2804,  -4731,   -675,  -5226,   2388,   5397,
         2156,    705,  -1670,   3158,  -4880,   2791,   2374,   1603,
         -420,  -1869,  -5134,    402,   -695,   5150,   2348,  -3445,
        -1723,  -3417,   2799,    425,   2264,  -2913,  -1488,   2237,
        -2271,  -1828,  -2132,   -308,   1212,  -4178,   -332,   3294,
         3449,  -1302,  -3210,   -281,  -4106,   4167,   1365,   3757,
        -2565,  -4369,   3480,  -2652,    734,   4637,   -615,  -1121,
         1763,  -3313,  -3938,   -880,   4326,   3929,  -3384,   -936,
         1095,    -92,   5124,  -2715,   1843,   4157,  -5153,   4411,
         4626,  -3337,   1066,   2547,   1204,    514,  -4045,   -339,
          286,   1592,   5005,   5594,  -3071,   3725,  -2049,   2835,
        -3699,   2089,   3372,  -4796,   2241,  -3402,  -3367,   4014,
         4592,   4819,  -2273,   -637,   1286,    976,  -4774,   1475,
        -3948,   5225,  -1711,   2983,    622,   -812,   4936,   -111,
        -6014,  -2141,  -4061,   -691,   4518,  -2877,  -4478,    -49,
        -3476,   3220,   4214,   -706,   1306,   3517,   2583,   -998,
        -4794,  -5025,     34,  -4841,   1879,  -4701,   -508,   1161,
        -6889,  -7923,   6264,  -2667,  -5503,   2036,   1976,  -4207,
         -383,   -266,  -5342,  -2678,   1678,   5664,   5080,   1637,
         -939,  -4563,  -3982,   1163,   3911,  -6557,   2758,  -4134,
         5156,   2651,  -2858,   4813,  -1313,   4444,   1679,  -2552,
        -2063,  -9334,   -786,  -8820,  -2497,  -3246,   1206,   -659,
         7239,  -2530,  -1157,  -2439,   2796,  -3432,   1329,    611,
        -4902,   2080,   -454,   -348,  -4104,  -1285,   3688,   -933,
         4537, -10921,   4080,     89,  -5947,  -1991,    782,    315,
         3336,   3496,   1073,   1304,   -668,  -4934,  -2346,  -1331,
        12080,   1039,  -4299,  -4465,   3554,  -4842,  -1790,   1735,
        -1010,   2004,  -5565,    401,   1369,   1752,  -3833,     51,
         6489,    842,   4044,   2203,  -6642,   6639,  -1346,  -4634,
          981,    359,  -1101,  -1421,  -1212,  -3542,   4345,   2992,
         -440,  -2544,   -802, -11081,   2986,    493,    835,   -941,
         -288,  -2554,   5377,   -616,  -5191,  -4970,  -4938,  -3118,
         1889,   2927,  -5219,   4443,  -2710,  -4738,  -2457,  -3752,
        -1038,   1884,    135,  -2591,  -3327,   5824,  -5593,   2654,
         7801,   6204,   -762,   2429,    660,   7568,  -2611,   3336,
         2606,   3583,  -1969,   4517,  -3211,    379,  -2985,   4409,
         -302,   7352,  -1077,   -850,  -3670,   1978,  -3405,   2155,
         2127,   5266,  -3052,   1403,  -5567,  -4815,   4556,   4405,
        -3396,   5007,  -1022,  -4476,   1404,   -340,   4467,  -4780,
         1325,    993,    727,   2622,   2594,    350,   -414,   2257,
         2122,    176,  -1789,  -1126,  -3576,  -3173,   2912,   3469,
         3120,   -638,  -1181,  -2837,    131,   4484,  -1377,  -2580,
        -2025,   3719,  -2795,   2934,  -6986,   -246,   -557,   1102,
        -3459,  11009,  -5399,   3793,   3392,  -5422,  -1625,   4347,
        -6608,  11686,  -5921,   2742,   3286,   5288,   4468,   2220,
         4439,    411,   2842,   -399,   -278,   4840,  -4678,  -2707,
         4580,  -6084,   1108,    650,   -807,   4560,   1540,    500,
        -5019,    925,   1266,  -6625,  -4254,   5184,   4667,   3047,
         2069,    171,     64,  -6931,  -5221,  -5184,   3361,  -4235,
        -1333,    355,    355,  -2047,  -5442,  -2156,  -4798,   -180,
         2264,   1224,   4170,   3315,  -1354,   -558,  -4058,   2082,
         1154,    769,  -3250,  -7086,   1814,   -921,  -5102,  -5896,
         -467,   4744,  -5572,  -2294,    308,   -822,   4527,   1929,
        -3246,   -950,   -870,   6649,   1419,   1182,  -2749,  -5823,
           28,  -4703,   3077,   2596,   1286,  -4437,    727,  -4193,
        -1868,  -8374, -10979,   4095,  -2950,   5514,  -3688,  -4059,
        -7974,  -3326,   2579,  -5178,   3466,   3379,  -2340,   2311,
         1519,  -3106,    291,  -3367,  -1441,  -4002,  -4179,  -3749,
         2310,  -2742,   -352,   -536,  -3908,   1059,  -2909,   4091,
         2196,   2145,  -1328,   4785,  -3518,   6324,   2544,   3072,
        -1445,  -5209,   5580,  -3026,    213,  -2565,   1093,  -3391,
        -3513,   5293,  -5418,   5678,  -5559,   9295,  -3905,  -1791,
         6110,    840, -12282,   4608,   2393,   7864,   2508,  -3238,
         3756,  -2961,    -94,   1846,   3838,  -2573,   1646,   4373,
         3710,   3170,  -4337,  -1406,  -2770,   5859,   3243,  -4767,
        -2955,   2797,  -2560,  -2591,  -1987,  -2086,    339,  -2432,
           43,  -3879,   4395,  -5595,   3079,  -2904,   3242,  -1080,
         2774,   3676,  -1756,  -1884,   4375,  -4099,   -373,   -546,
         4455,   3201,   3845,   2446,  -5737,  -3740,  -5675,  -5267,
        -9035,  -1657,   4184,   3953,  -1190,    633,   1324,    -37,
        -5573,  -3722,    361,     15,  -5462,    747,  -3782,  -4858,
        -3085,   2662,  -2112,  -3553,  -4143,  -2145,   1524,  -5151,
         2057,   2586,    254,    942,  -5550,  -1025,  -3013,    220,
          132,   4413,   4118,   6407,   3056,   5404,   4487,    201,
         3905,   1234,    646,  -1771,  -3150,   3370,  -4163,   3861,
         1162,  -4986,  -4042,   4186,  -5029,  -4281,   3094,   -261,
         3423,   2977,   2449,   4479,  -3984,   1885,    630,   -167,
         4010,  -3000,    771,  -2036,  -4170,      9,  -4228,  -3505,
         -685,   5868,  -2246,  -5065,  -4598,  -2176,  -1120,  -3344,
        -3019,   -646,  -4561,   2734,  -6468,   2175,    299,   -981,
         5785,  -5089,   3947,  -4854,  -1071,  -6279,  -5748,   3611,
          863,  -4290,   2910,    304,   4578,  -1755,   1637,  -3456,
         4243,  -1675,   -707,   1074,   -485,   1647,  -2520,  -1273,
        -2354,   -999,  -1051,  -4058,   1081,    302,   4226,  -1377,
         3654,  -2099,   2035,   3059,  -1336,  -3000,     20,   5441,
        -2648,   1697,   4335,   4724,   4883,  -3417,  -4767,  -4716,
         4735,  -2221,   2145,   2159,   4704,  -4621,   -859,   3060,
         5157,  -2646,   1733,   3492,   2903,   4575,  -3351,  -3335,
         3338,   2117,    204,   3241,   -849,  -4165,   1010,    715,
         1808,  -5035,   -228,   3224,    442,   3032,   -460,  -4107,
          847,   -830,  -6708,  -5542,   1087,   4705,    694,   2931,
         3013,  -7183,  -4214,   -892,   1874,  -3632,    161,  -2520,
        -3831,   8493,   1203,    522,  -6195,   1670,  -2127,   -865,
          686,   3914,   -566,  -4696,  -1910,   6978,   -387,  -3725,
         5135,  -1612,   -499,   -930,   3314,  -3325,  -2105,    362,
         3293,   4672,   2554,  -2604,  -4163,   1920,  -2954,  -1427,
         5420,   -216,   4834,  -7872,   2487,   5960,   5533,  -2055,
        -2743,   3607,   2908,  -3061,   1081,   5668,  -1730,  -4764,
           30,   -401,   -328,   4729,   -851,   3344,   3046,   1638,
         1682,  -2305,    134,   -357,  -4478,   3606,   2669,    559,
        -2550,  -4355,   1435,   2418,   3512,  -4753,   2872,  -4280,
         1448,  -3031,   1097,  -1726,  -3208,  -2413,   1795,    406,
        -1428,  -1423,  -3433,   -476,  -4969,  -4354,    325,    881,
        -1349,  -3381,  -2456,  -1790,  -1622,   -753,  -4579,  -5126,
          288,  -4792,   2442,  -2146,  -3132,   1420,   4975,  -2720,
        -2971,    399,    407,  -4263,  -3290,   3961,   3277,    688,
         4159,  -4451,  -3309,  -2220,   3824,  -1494,  -2090,  -5232,
         -950,    249,  -1005,  -5615,    773,   3994,   4383,  -4661,
        -5432,    660,   4247,  -5587,   5282,  -7036,  -2570,   2431,
        -1878,   4090,   -288,   4343,  -1136,   3671,   4962,   2081,
         4143,   4410,   4295,    187,  -5419,   1756,   1345,   2048,
         7764,  -2047,   1205,   -964,  -5299,    759,   2168,   1174,
         4548,   -735,    -85,  -4445,  -2648,  -4203,   2016,   2655,
         2646,    449,  -6405,  -6128,  -6251,   1028,   -639,  -4198,
        -3484,  -7129,   2178,  -3493,    860,   6354,  -2908,  -4795,
        -2014,   3135,  -1825,    795,   1301,  -2802,   1824,   -133,
         7314,   1098,  -3768,  -2602,  -4711,   -448,  -5816,   1646,
        -3552,  -4147,   -627,    546,  -2699,  -2629,   3799,   1648,
         8400,  -4394,  -6169,   1597,    554,   4421,   4644,  -4864,
          489,    -11,   -618,  -1602,   2893,   4089,  -6075,  -5936,
         2228,   1022,  -1079,  -4275,  -3784,  -3269,   4065,  -1706,
        -4060,  -5990,   3026,  -2037,  -4400,   2188,    726,   3879,
         6152,   2507,   1868,   2057,  -3823,   6555,   1050,  -5059,
        -4996,    165,   3920,  -3125,   2359,  -3872,  -4780,    342,
        -4572,   8102,    990,   6102,  -3983,  -3353,   -405,   -408,
         6105,  -2599,  -7807,   2063,    282,   6404,  -4021,  -2519,
        -2107,  -1876,  -2953,   -315,  -6163,  -2067,   1894,  -2714,
        -1218,  -1786,   -439,   5067,  -2218,  -3071,  -5212,   -356,
        -3433,    822,    198,   3828,    150,    368,   4224,   -224,
         2450,    249,  -4059,  -4578,  -3199,   -103,   3535,  -1376,
        -3355,  -1143,    999,   6027,   1671,  -1115,   4270,   2460,
         4841,   6551,  -3302,   2545,  -2172,  -1954,   2585,   2140,
          149,   2321,  -4693,  -7564,  -1911,    757,  -3801,   2570,
          290,  -1278,   3192,  -2122,   4158,    726,   1295,   2147,
        -4956,  -1334,    -94,   2832,  -5691,   4814,  -2202,   4161,
         -352,  -1116,  -7382,   3902,  -2485,   2768,  -3769,  -4599,
         5358,   -678,  -6173,   3732,   -479,   2287,  -3535,    117,
         2264,   6667, -10559,   -824,  -4444,   -137,  -3899,   -895,
        -5826,  -6422,  -4388,   5204,  -5712,  -1577,   2881,  -2441,
         4235,    679,   1500,   2787,   -546,    553,   1632,   4794,
        -1499,   1669,  -7038,      5,   -141,  -3570,   2551,  -4201,
        -5546,   7927,  -2496,    528,    157,   1576,  -3374,   3876,
         -922,   3686,  -7207,   2262,  -1133,   3814,    242,   2194,
         4591,     29,   -252,  -7267,   4888,   6157,  -4954,   1299,
         1393,   5521,    346,  -1214,   2432,  -1646,  -6121,  -2445,
        -2754,   4204,  -7582,   1687,   2512,   4353,    112,  -2903,
         1642, -10391,   1304,   -354,  -3999,  -1503,  -5563,  -1526,
         3271,   -772,  -7819,  -8279,  -4580,  -3948,  -2054,   3057,
         4421,   4230,   3175,  -1247,   2493,  -5619,   1900,   3171,
         1944,   -675,  -3490,  -6371,  -6467,  -3984,  -5768,  -5136,
         3741,   2619,  -3793,  -2944,  -6359,    897,   2798,     45,
         3874,   3068,  -5516,  -3959,   2908,   -561,  -5091,   4532,
        -1308,   3049,  -1184,  -6701,  -5516,   3189,  -1040,  -4284,
         -336,  -5640,   6459,  -4706,  -3913,   -222,   3436,  -2663,
         4931,  -1192,   -297,  -6436,   2139,   3479,  -3105,  -3165,
          409,  -3835,  -1166,  -7142,   -417,  -1851,    396,  -5304,
         5416,  -4613,   3670,  -5868,    634,    889,   2841,  -6122,
        -7111,  -1605,   7648,  -2087,     20,  -1914,  -1276,  -1728,
         3191,   1538,   4214,  -4421,  -5582,    742,   3777,   1821,
        -2261,  -4915,  -4059,  -2270,   4732,    801,    503,  -1272,
         1247,   -737,   2291,   5437,  -3639,  -6360,    924,  -4149,
         5696,  -6543,  -5459,  -1297,   4963,  -6603,    988,  -2634,
         4057,  -6741,   1203,  -6915,    958,   1184,  -4181,    404,
         4079,  -6288,   5848,    895,   1651,  -2219,  -3092,   1867,
         2157,   2743,   -876,   3084,  -1588,   8477,   2162,   2737,
        -3281,  -1876,   1954,  -4784,  -5536,   3681,  -3838,   -925,
         2973,   3505,   2102,  -4407,   3693,  -1734,   1441,  -5228,
        -2798,  -2890,  -2631,  -3739,   4051,  -1231,   2600,    606,
         -817,    394,   2598,  -4694,  -5293,   1915,   1398,  -4887,
          667,  -3046,   2548,  -7559,   -591,  -2986,    605,  -4958,
         2406,   -599,    870,  -1998,  -2219,  -6264,  -1251,   1292,
         1664,  -4301,   4469,   -530,   5060,   4101,   3165,   4897,
         3434,   1389,  -4187,   3473,   1996,    948,   -775,  -3539,
        -2721,  -1160,  -5611,   3259,   3455,  -2533,   2827,  -1006,
          915,  -1297,  -1901,   2549,   4589,   -293,   1816,   3868,
          103,   4179,   -907,  -3315,   3622,    810,  -4899,   1446,
        -3190,    508,  -5338,     33,   -673,   2000,   4764,  -2694,
        -3874,   2702,  -4678,    688,  -2729,   1833,    949,   4713,
        -1319,    783,  -1568,    559,    -10,   -562,  -1923,  -2638,
         3710,  -1158,    122,   -393,  -2263,  -1987,   2232,   3822,
          501,      2,   3456,   1905,    484,  -2050,   4956,    469,
         2882,  -1640,   1421,   -696,  -3831,  -1138,  -1621,   -167,
          854,   4351,  -5080,  -4412,   -174,   4621,   -539,   3511,
        -1118,   2375,   -312,  -4555,   4246,   2750,  -1812,    233,
        -4022,  -2440,  -1477,   4057,  -2646,  -1618,   1109,   2613,
         2510,   -579,  -2073,  -2303,  -4995,  -1596,  -3228,   3792,
          291,  -2159,  -3491,   2058,    826,  -5122,    766,  -1433,
         2762,   3294,  -4592,  -1157,  -2735,   4506,  -2076,  -4576,
         -588,   4056,  -1504,   1519,   1796,   4102,   2801,   4683,
           61,  -1757,  -1481,  -2798,   4867,   5006,   4804,   3840,
         1176,  -4324,  -1383,    737,   3179,  -2716,  -3686,  -1557,
           27,  -4545,   2080,  -5565,   2517,  -1285,   3526,  -2874,
         1168,  -5678,  -1913,  -3015,   2215,   6024,   2270,    -55,
        -3635,  -2562,     15,   1870,   1374,   6719,  -3679,  -5091,
        -3439,   1423,  -6061,    836,   5062,   6956,   2465,  -4315,
        -1392,  -4154,   2109,  -2539,   2783,   -487,   4628,   5413,
        -3742,     52,   3230,   2667,   -769,   2527,    201,      4,
          626,   1560,  -6421,    858,  -4836,   3280,  -3093,  -4112,
        -3108,   2548,    784,   -741,  -6602,    603,   1105,  -1858,
        -2466,  -3886,   -194,   1741,   3342,  -6897,   -681,   1887,
        -3039,  -5714,   1244,  -2667,  -3675,  -1646,  -5008,  -3201,
         5125,   3416,  -1084,   1956,   -582,  -3743,  -5583,  -5839,
        -3054,   4628,  -4142,   1575,   4722,   1357,  -5191,   4595,
         3803,  -2800,   3888,   4601,  -1984,   2984,   3712,   -436,
         2160,   2070,   2852,  -6125,  -2162,   -676,   1345,   1503,
        -1797,   5404,    410,   3981,  -3580,  -5838,  -2277,   2607,
         -501,  -4515,   -411,  -2834,  -2698,     41,   4589,   3116,
        -2674,  -4358,   -760,   -237,   -550,  -2552,   -741,  -3526,
        -4225,  -3692,  -1341,   3480,  -3217,   1928,  -1550,   -203,
         1113,   1052,  -1007,  -1903,   4294,   3852,  -4934,   2971,
         3686,   5208,   1469,    813,  -1176,   4488,  -4012,  -5489,
        -1355,  -3508,  -5186,   1109,   1271,   4592,  -2527,  -2873,
         3416,   3942,   2587,    629,    773,   4610,   2592,   3056,
        -3161,   1667,  -4695,  -3797,   3686,   1072,  -1891,  -3060,
          908,   5822,   3314,   3959,  -5388,     26,   -825,    303,
        -5504,  -3106,  -1788,  -2653,   3109,     80,   2435,  -1024,
          821,   3322,  -1565,  -1405,  -5006,   3947,   3870,  -2957,
        -1271,    -84,   1636,   4598,  -6271,   1422,  -5388,    365,
        -6682,  -7379,    895,  -3481,  -1073,  -4475,  -4086,  -2757,
         5063,   -921,   6772,  -3490,   1970,  -2458,  -2590,    491,
         3986,   3923,   6033,   1077,  -5197,  -4593,    -41,  -5038,
        -2535,   1889,   2016,   3773,   4014,  -4919,   2231,    430,
        -3974,   -641,   1737,  -7069,   2728,   2285,    623,   1183,
        -4992,   -423,  -6500,  -1434,   4978,  -4898,   4597,    608,
        -8410,   4099,   5797,   4840,  -5515,   1762,  -3514,   1062,
        -3133,  -5805,  -3937,   2128,  -4270,  -4605,   1700,  -1560,
         3688,  -3090,   6251,  -3804,  -4569,    897,  -3593,   2351,
         4362,  -5717,    128,  -1223,  -5443,    245,  -4112,  -1886,
         4174,    431,   4598,   4853,  -3298,   2654,    790,   4911,
        -3504,  -6810,  -4374,   -770,  -3349,   -217,   3515,  -1056,
         -417,  -3647,   3189,  -5877,   -811,   3577,   -969,  -3977,
        -6352,  -3630,   4963,  -1897,  -2937,   4482,    688,   2423,
         -848,  -1339,    783,  -3014,  -1730,   -598,   5174,    282,
          360,   3978,   4930,  -2486,   3785,   -457,  -3160,   -458,
        -5516,   8892,  -4244,  -3905,  -1904,  -3418,  -4007,   -744,
         2177,  -1605,   1150,  -3837,  -4485,  -6043,   4372,  -3058,
         -532,  -2123,   -549,  -7918,  -7098,  -4587,  -2989,  -5685,
        -2569,  -1386,   -222,  -5175,  -5921,  -4079,  -1433,  -5835,
         -224,  -3923,    458,  -3077,    -80,   -491,    276,  -4204,
         4965,   -245,   -315,   1261,  -1002,  -1875,   3326,   2160,
        -4643,  -1128,     38,   2694,   -385,   2318,    -31,   3525,
       -10283,  -2186,    765,   3731,  -5943,  -2958,   1344,  -2066,
         -634,  -5145,   1433,   2412,    782,  -3636,    579,    663,
         -757,   2293,  -1697,  -5548,   1236,   3271,  -5337,  -3979,
         2834,  -2211,  -2678,   4439,   1598,   3623,    923,  -1647,
        -3282,  -1441,  -3342,  -1673,  -3634,    222,  -5837,  -4412,
        -6943,   -386,   -498,   -971,  -2386,   2257,  -3388,    128,
         2426,  -6980,   1710,    487,   3748,  -6468,  -2543,   3358,
        -5831,  -2224,  -1016,   3509,   2010,  -3328,   2055,  -3123,
        -7853,  -4174,   -486,   1119,  -5473,   -558,   3049,   1396,
        -3488,   2503,  -1544,  -4910,  -1334,  -2560,   3391,  -4225,
         5640,   -513,   3051,   -454,  -5542,    -97,  -4453,  -1558,
        -1885,   3282,  -4019,   4045,  -5130,    231,   4619,   -135,
        -1444,   3989,  -3122,  -5293,  -2502,  -3136,   1502,  -3493,
         -553,   2134,   4425,   1096,   2797,     60,   2363,   3057,
         2326,   -857,  -2584,   1837,   -914,  -3382,  -3336,  -2911,
        -3477,   1644,   2400,  -4046,   -626,   -630,   1084,   3991,
         1919,   4464,   2966,    535,   3614,    913,  -3827,   2161,
         1572,   3247,   2410,  -1918,  -3199,    -80,   3833,    980,
         2602,   1135,     95,  -3978,  -4579,  -2655,   1330,   4831,
         4030,  -4486,   1451,  -4705,   2575,  -4907,   3810,  -4622,
        -3592,   3898,    306,   -543,   3356,   2863,   -490,   -891,
         6248,   2213,  -4833,  -5779,  -3026,    276,   3196,  -1394,
         2348,   1933,   4828,     68,   -279,   2016,  -2936,  -5338,
         -247,    710,   -365,  -1646,  -3257,   1977,    243,  -1553,
         2655,   -823,   5532,  -5462,  -2916,  -2892,   1456,   1173,
         5421,   2989,  -1736,   -910,  -5572,  -3139,  -5549,  -1746,
         2170,  -4808,   6748,  -4838,    774,  -4011,   1882,  -5329,
         1173,  -5651,  -1158,   1304,  -5679,   -997,  -2011,   -492,
        -1581,  -1644,  -5126,  -2229,   1077,  -2655,   4123,    280,
        -4194,   1037,    230,   1602,  -2660,   -351,  -5756,    470,
          976,   5445,   3001,  -2170,   4074,   -636,   4386,   2407,
         4979,   3607,   1053,  -5874,   3091,   7608,  -4856,  -4365,
         4593,   -833,  -4976,  -5805,    588,     38,   1190,   2265,
        -1765,   1361,   2224,   1791,  -2218,   2197,  -5354,    296,
        -1157,  -2871,   1362,  -1224,  -4131,  -3284,   3414,   4975,
        -2325,   1990,  -2036,  -7235,  -3292,   1586,  -5462,  -5484,
         3012,  -4098,   5111,  -9679,   4829,  -2179,  -4595,   3649,
         4505,  -6624,  -3568,    911,  -1455,  -2613,  -2610,  -1971,
         -961,  -5238,  -1222,   1712,   1679,   2888,   1057,   -719,
         6986,  -6830,   -612,   2416,  -4718,  -4490,   4868,  -3313,
        -3044,    234,  -7425,  -1946,   3102,  -1029,   1379,  -4379,
        -2046,  -4022,   5363,    195,  -5964,   2242,  -5657,  -3425,
          329,    941,   1302,   6047,   3793,   2781,   -453,  -3264,
         3576,   -851,  -4765,   3345,  -2805,   6043,    146,  -2536,
          240,  -9306,  -1671,  -3963,   -456,  -2966,  -1355,   -930,
        -2190,   1217,  -2424,  -1188,   1828,   -178,  -1672,   3450,
        10595,   7510,  -1648,  -2608,  -5807,   3457,  -2921,  -1381,
         3672,   -127,     87,   1009,  -6474,  -2946,  -2092,  -4113,
         -981,  -3270,  -1511,  -3226,   4375,   -868,   4691,   4238,
         4713,   -381,   2455,  -4652,   2613,  -3284,   1291,  -5731,
         3271,   2847,   1375,   2184,   3996,  -7512,   1257,   2589,
        -3097,  -2991,  -4706,  -1401,    142,  -4480,    367,   3074,
        -4304,  -5930,   2489,   1579,   2295,  -4456,   1879,    882,
        -6352,   3090,   7753,   -551,   2246,   5626,   5059,   3544,
         3428,  -2899,  -2310,  -1832,  -1419,   2288,   3899,    908,
          -42,   1225,   2510,   5135,    396,   1871,    -87,   1359,
         6262,   2544,   -184,  -2083,   2106,   7576,   2282,  -1356,
         5839,  -5666,   -370,  -3678,   -842,  -5909,  -4425,   -318,
        -4017,   3290,  -2303,   -665,  -5631,   -771,   3921,  -2918,
        -2292,  -6395,   1022,   -339,  -4098,    478,  -1171,  -4591,
         1174,  -1582,   2734,   8116,   -577,    161,   -410,    -27,
          693,   2269,   -593,   2297,   3702,  -3850,    426,   1900,
          219,   2913,  -1744,  -4002,  -5010,   1582,  -1995,  -1286,
         2591,  -3047,   -700,   -899,   1173,   3774,  -4143,  -1605,
         7333,  -1068,  -5401,   -870,  -3574,   4734,    -14,  -4071,
         3009,  -3065,    828,   1915,  -3610,   3036,   4723,    206,
        -5693,  -2514,  -3007,   -159,   3100,   6363,   4333,  -1561,
        -1885,  -3905,   -320,  -4857,   2657,   5012,   -692,   -116,
         1601,   3314,   3422,   -425,   2402,   4872,  -1923,   -105,
         1136,   3582,  -3763,   1893,  -3685,  -1320,  -1742,   1475,
        -7648,    -62,    183,   4437,   4869,   1283,  -2904,   5392,
        -1856,   -496,   5154,   1430,  -5927,   2591,   2130,  -5718,
        -6485,   1971,   4788,   3164,   2667,   4156,    969,    831,
        -3228,   5083,   2145,   4647,  -5081,   2179,   2297,  -2708,
         4489,  -2798,   2120,  -4097,   2068,   1851,  -4009,   2930,
        -1246,  -3136,   4704,  -8793,   3431,   -520,  -1693,  -3729,
         5005,  -5519,    499,   5133,  -4377,  -2903,   1638,    420,
          221,  -7646,   5171,   3471,  -1901,   2923,  -3037,   3132,
        -2481,  -2085,    136,  -5363,   1067,  -3103,  -4019,   1199,
        -2499,   6842,   2568,   2129,  -4419,  -1132,   4899,  -2700,
         3795,  -5644,     52,   1215,   2044,   5629,   3691,   3072,
         6761,  -2275,  -2161,   3589,   1295,   4089,   1177,  -1018,
         -960,  -2436,    983,   9500,    655,  -7220,   1558,   4653,
        -6992,   -832,   -162,    224,  -4405,   1659,  -3280,   1094,
        -4671,    193,   3451,  -5601,  -1350,   2517,  -4497,    308,
        -1435,   1867,   1120,  -2938,  -1474,  -3050,  -5076,  -2362,
        -2946,  -1928,   -124,  -2510,  -1852,   5247,  -4164,   2498,
        -5169,   1557,  -6444,   4134,   2493,   5660,  -4922,  -1786,
        -1851,   8334,  -9316,   9393,   2658,  -1696,  -2837,   3686,
        -3016,   5822,  -1037,  -4099,   1425,   1574,   5088,  -2581,
        -6905,  -1120,  -2531,     43,  -3218,  -1128,  -2585,  -3879,
        -1305,   6420,  -3541,   4035,  -1166,   6056,    -41,   4241,
         6442,  -6272,   2531,  -1223,    442,   1346,  -5896,  -1871,
        -4740,  -6270,   2734,   2829,   1574,    995,  -5939,   4552,
         -587,   2481,   5307,    -35,  -2452,   -610,  -3276,   4020,
         5846,   5527,   4123,  -4934,  -2795,  -2051,   1317,   4432,
        -2969,   4223,  -2941,   2746,  -3816,     12,  -2372,   2867,
        -7233,  -2789,  -2759,   2531,  -2845,  -3531,  -1286,  -4575,
         3197,   -814,  -3817,  -4155,    804,   4546,  -3897,  -3216,
         -826,   3751,   4473,   -643,  -4400,   3868,  -1840,   -936,
         6084,   6357,   -374,    781,  -5283,  -6894,  -3271,  -3012,
        -3035,   1408,  -1375,   4229,   -402,   4434,   2894,  -1846,
        -5463,  -1784,   5498,  -2176,  -4313,  -2556,   -335,     37,
         2643,   3033,    565,   1954,    696,   5399,  -2732,   5230,
        -3970,   1055,    288,   3622,    271,   4119,  -5195,  -1723,
          946,   1945,   1203,  -5344,  -2877,    484,   1059,  -1733,
         4592,   -204,  -4559,  -2285,    567,   1492,  -4649,   -534,
         1735,   4082,   -322,   2280,    981,   -788,   -253,   2191,
         2411,    560,   2074,  -1328,   1340,   4281,  -4894,  -4577,
         1578,  -4073,  -3448,  -5657,   4124,  -3249,   4784,   4693,
         -245,   2174,  -5018,   -415,      6,  -3285,  -4510,  -5019,
        -3299,     -1,   5733,   2759,   1425,  -1426,   4051,  -4102,
        -1611,   -251,  -1070,   3061,  -3466,  -3412,   2126,  -5363,
         7302,   2750,   1105,   2119,   2843,  -6912,  -2376,   1309,
        -3494,  -2987,   2192,  -2844,   3663,   3481,     47,   -929,
        -7199,   -891,   3954,   1379,  -6552,  -7601,   3081,  -1411,
         1805,  -1018,   2263,    318,   2496,   4946,  -4900,  -1946,
         4873,   2960,   5104,   4929,  -1694,  -4249,   1972,   2556,
         8185,  -6955,   5894,   1107,   1119,  -5575,  -2300,  -2367,
        -2649,  -1476,    727,  -4106,  -2857,  -5190,  -4577,   3881,
         2728,  -7278,   1439,  -1325,   2133,  -2875,  -4874,  -2822,
         4220,   -391,   1087,   1908,   2788,   4243,    971,  -1441,
         2454,  -2549,   2009,   4035,  -2627,   3300,  -5676,   2603,
          270,  -6386,   3300,    517,   2035,    324,   5050,  -1138,
        -8165,    633,   4983,  -4241,   4539,   5410,  -5171,  -5221,
        -8117,   5314,  -4612,  -1496,   1484,    319,   4490,    242,
        -3172,    179,  -4130,  -4319,   1191,    204,   4965,   3041,
         3576,  -1514,   -386,   3602,   3146,   1830,  -4780,  -2869,
         1901,  -1819,    941,   3350,   2179,   5582,  -1413,   1687,
        -1826,  -1507,   2860,  -7994,  -6365,   -478,   4380,   2041,
          966,   3072,  -1825,  -4784,   2430,  -1107,  -2972,  -1573,
         3737,   -277,  -6293,  -4396,  -1516,   1131,  -2716,   4290,
        -3558,   2463,  -2717,    719,  -4979,   4174,   -818,   2167,
        -5800,   -603,  -2893,   4551,   2848,   6066,  -3677,  -3676,
        -5038,  -1078,   4952,  -1637,    665,  -2596,  -4732,  -1945,
        -2202,  -5579,  -1082,  -1063,  -5527,  -2530,   -808,  -5620,
         1870,  -6183,   1811,    -51,  -1917,  -2780,  -2411,   -398,
        -3814,    649,   4705,   3916,   2656,   2355,   4702,  -3331,
         3375,  -4973,   1226,   1676,  -2558,    552,    903,  -1745,
        -2161,  -3366,   4545,    144,  -6996,   1822,  -5925,   -176,
        -1287,  -6082,  -2417,  -4419,  -4211,  -2751,  -5220,  -5128,
        -1529,   -304,   1713,  -2513,   -933,  -1072,   4687,  -4178,
        -5408,    489,  -3167,  -3693,  -4907,  -3677,  -4044,  -5959,
        -3637,  -1151,   6818,   -440,  -5032,  -4880,  -1970,   -654,
        -5257,   4245,  -1934,    881,  -5652,  -2083,  -2121,     37,
         3358,  -3336,  -5121,  -4132,  -4694,   6674,  -2279,   1481,
        -1280,  -2208,   3383,   -658,  -4478,  -5837,    320,  -1346,
         7231,   5945,   4310,   1297,   3309,    416,   2669,    698,
         6886,   4189,  -3914,  -6890,    795,    734,   1189,  -3059,
        -1354,   1637,   4408,    316,  -4597,  -1583,   2131,  -3158,
        -3004,   4315,    375,   1808,    173,  -1309,   4196,   2773,
         3871,   4285,   2294,   2032,  -6903,   -759,  -2194,   1888,
        -3833,   5163,  -3472,   3182,   2291,  -1573,  -3791,   2801,
        -5514,    532,    878,  -2209,  -6148,  -6000,  -1952,  -3407,
        -2369,  -6838,   3860,  -2183,  -5172,  -3689,  -5025,   2318,
         5087,   8050,  -5490,  -1066,  -1504,  -3226,   -632,   3093,
         -392,  -4506,   -342,   -781,   3698,   5328,   4637,   2863,
         4712,   5577,  -4012,   4898,   3586,  -3779,     12,    927,
         1966,   6945,  -8364,   6324,  -4382,   -283,   3373,  -2305,
        -5192,   2700, -10097,   5511,   -470,  -3295,  -2090,   2995,
        -3229,   2585,  -3773,   5535,  -4011,  -2271,  -2674,   1486,
        10268,   5330,  -1102,  -4027,  -1189,  -5684,    588,   4542,
        -3177,   3766,  -4201,    376,   2079,  -2794,  -3773,    226,
         1169,   4646,   -256,   1757,    478,   3667,    511,  -1441,
        -3935,   2217,  -4319,  -2342,   3009,  -1342,   1259,    300,
        -1261,    -90,  -9658,   4753,   4090,   1404,  -2109,  -2360,
       -11598,   1948,  -2387,  -8214,     19,   4972,  -5073,  -5771,
        -4285,   4835,  -2964,   4775,  -4633,  -6343,  -1587,  -1172,
        -2219,   -260,  -1383,   4290,   -154,  -9756,  -1500,   -128,
         -747,  -2522,   1783,   5678,  -1047,   4492,   2356,   2186,
          -65,   1511,   -779,  -7182,  -3311,    -92,   3917,  -2504,
         1935,   5569,  -3929,   9695,  -3895,  -2065,  -4956,  -1444,
         9628,  -4413,  -8746,   3392,   4108,   7467,  -3985,   3904,
         1675,   4241,   5903,  -5015,  -3232,  -1618,   2222,  -4456,
          756,   -841,   3353,   3600,   2543,   1337,  -2099,  -5982,
         5862,  -4478,  -2451,   2142,   2613,    305,  -4192,   1289,
         1134,  -5334,  -1742,   4086,  -1099,   3618,    743,   3219,
         1901,  -3584,  -5967,  -4919,   1094,   2871,   1160,  -4342,
         2760,   3837,  -6219,   2168,    123,   5598,  -4772,  -4574,
        -4334,  -2050,  -4889,  -4316,   1810,   2670,   -919,   3762,
        -6448,   1431,   -902,   2949,   1840,  -1464,   4888,  -2593,
         2428,  -4868,   3278,   8491,   1506,   1299,  -1770,  -5360,
          -97,   -509,  -5962,   4254,  -4827,   -472,  -3384,  -3625,
         6914,  -7073,   1738,   3951,   1416,    289,   3001,  -4583,
        -5179,   2650,  -4856,   -779,  -3961,    707,   -379,  -4185,
         5496,   4025,  -1183,  -5920,   1752,   3435,   2074,  -4748,
        -4793,  -4519,  -1611,   4018,   -971,  -2276,  -3010,   2815,
        -5363,  -5868,   4774,   4864,   1319,    384,  -3955,   1841,
        -2804,  -1613,  -4465,  -5029,  -3378,   1250,   3681,   4406,
         3160,   5208,  -1304,   1721,   1766,  -1016,   2916,  -3488,
        -5785,  -2960,    980,   4116,   -426,   3451,  -4270,   -467,
        -5045,    107,   -838,  -3010,    172,    406,  -5871,   1953,
          988,   1425,    654,  -3999,  -1519,  -4235,  -3064,   4402,
          810,   3278,   -248,   5419,   2045,  -3773,  -3113,   4439,
        -2246,  -2807,   3335,  -6508,    -91,  -1094,    199,  -4950,
         6045,  -4054,   7779,   2999,   -936,    624,   3147,  -5310,
         7338,   5692,  -1655,   2236,   1112,   5149,   2435,   -278,
        -2792,   1029,  -2418,   -236,  -2507,     12,   4463,  -3554,
         -550,  -4455,   -134,  -3891,   -229,   3213,  -3691,   3912,
         4222,   1502,   7007,  -5576,   -550,   2787,  -3783,  -2366,
         4546,  -9741,   2053,  -1573,  -5790,    401,   1117,   -851,
        -8546,  -7629,   5313,  -2496,    376,  -3530,  -5782,   4075,
       -10159,    444,   -998,  -1631,  -3116,   7061,   -350,   -607,
         -946,   4581,  -3101,   2209,   3103,  -1087,  -5967,    684,
          151,  -3809,   2557,   1871,   1437,   2439,   3921,  -2624,
         5955,   2573,  -3567,   -394,   3147,  -2665,  -5914,  -5587,
         5172,   5713,  -4532,   1301,  -1543,   1160,   2731,  -1209,
         3473,   1005,  -3724,   4772,   2273,   1287,  -5323,  -4105,
         -105,   4548,   2560,   3106,   2228,  -6661,  -1741,    391,
        -3829,  -1662,  -6713,  -6001,  -4920,   4083,  -4847,  -2526,
        -1079,  -6817,   3791,  -4074,  -3480,   2248,   -233,   3969,
         1155,  -1751,   1367,  -4866,   -304,  -2203,  -3030,   2239,
        -6427,  -2101,   4827,   3932,  -2463,  -4953,  -2871,   4080,
         1595,   1165,   3040,  -8150,   3176,   1248,   2810,  -1159,
         5704,   2068,  -6147,   2614,  -2196,   6922,  -2394,   -299,
        -5409,  -1152,   3959,   2956,  -4232,   4834,   -684,  -4507,
         -741,   3202,   -509,  -1703,   1471,   1807,  -3627,  -1460,
        10373,   5470,   3725,  -3048,  -4119,  -2337,  -2983,  -2062,
         1702,  -2930,   1979,  -4265,  -5066,  -2689,  -3599,  -3312,
         1445,   1084,  -3968,  -3271,   4431,  -4100,  -4808,   3516,
         7146,   4956,     -6,   5814,   -228,   4932,   1015,    784,
        -3239,  -3636,   -221,     30,  -5600,   -356,   3484,   3654,
         5103,    141,  -2380,  -3492,  -3271,   2847,   4154,   4464,
        -3614,   2990,    318,  -4162,  -2914,   1642,  -4766,  -4482,
        -2681,   4070,  -3561,   2533,    613,   -961,   -483,    506,
         4168,    433,   3957,   1490,   2188,   4750,  -1464,  -3135,
         -915,   4336,   3801,   5049,  -2373,   -959,   1783,  -2570,
        -2102,   2338,  -3814,   3047,  -2867,   3349,   3469,  -5124,
        -4255,    150,   3609,   1769,  -5457,  -2665,   4351,  -4231,
        -1748,  -3661,   2857,  -3748,  -3386,   1145,   3686,   1659,
         4014,  -4421,  -4742,  -1937,    -85,    824,   2185,  -1462,
        -3329,   -832,   3873,  -4357,  -1966,  -5977,  -2609,   4359,
        -2488,   1507,  -4845,    535,  -1997,   4977,   2736,   1265,
        -2948,  -2035,   -414,  -5717,   4342,    957,  -3386,  -2431,
         -886,   3302,   1337,  -1697,   4240,  -4161,  -5098,    187,
         1102,   2426,   4360,  -1038,      9,  -1004,   4801,   3450,
         1978,  -2066,   -765,  -5583,  -1917,  -3359,  -2943,   3046,
         5314,  -1525,   6024,  -2241,    313,  -6305,  -2633,    655,
        -3791,  -3363,  -3846,   3500,  -5911,  -3534,  -6022,   4605,
        -2124,  -2166,   1686,   -623,   -194,  -5349,   -361,   1285,
        -4717,  -2109,   4330,   5939,   -184,  -3774,  -3199,   2953,
         3393,   2794,  -2943,   3916,  -2084,  -1035,   2244,  -5473,
        -4039,  -1642,  -3151,   -409,   2654,  -4063,   2186,  -4540,
        -3597,  -5411,  -5526,  -1219,   3724,   4017,   1610,  -1878,
        -3427,  -3123,   1631,   1915,  -2796,  -3290,    632,  -3707,
         1708,  -1688,   1771,   5696,  -1275,  -1377,  -4174,  -1129,
         -218,   1433,   5714,   3213,  -4096,   1817,  -3665,   3827,
        -5237,   5159,   4169,  -2998,   -413,  -2220,   2904,  -2912,
         5943,   2492,   2893,    652,   3008,  -1211,  -4302,   2251,
         1488,   5126,  -2184,   6863,    518,    845,  -1645,   3255,
         5119,   1279,   -577,   -873,  -2167,   4710,  -5704,    297,
         4242,   6318,   1782,  -1128,   2803,   3505,  -5140,   2011,
         -804,   5033,   3394,    -87,     51,  -3423,  -2076,   2295,
        -3087,   1863,   5987,   3676,   -128,  -1778,  -3210,   -851,
        -4106,   3920,  -5536,  -3683,   3966,   -936,   4435,    741,
         2993,  -4220,   2826,  -2829,   2505,  -2395,  -5012,  -2919,
         1346,   8596,  -4676,   3386,   1840,  -2445,   2312,   3782,
        -3371,    185,  -1511,   -356,  -3227,    727,  -4453,   3297,
        -8419,  -3343,  -2870,  -2169,    611,   3567,   3998,   2717,
         -116,   3130,  -3568,   2239,  -5087,  -2352,  -3451,   4213,
         4465,   2228,  -4721,  -1730,   2665,   5128,   4893,    360,
        -8199,   6686,    135,  -3365,  -3887,   1689,  -4779,    848,
         2653,   2359,   2911,   1742,   3877,   6125,   4925,  -1889,
        -4208,   3333,     11,    742,   2996,   -162,  -2487,  -4593,
          139,  -4624,   -622,   5131,  -2319,   5048,   4565,   -434,
         1339,  -3935,    778,   -786,  -2934,   4482,    691,  -2617,
        -2776,   2510,     28,  -2841,   3085,  -2532,   -927,  -1801,
         -338,  -1691,  -3995,  -2022,  -4087,  -6188,  -5949,  -3017,
         5565,  -3945,   2757,   -589,  -5646,  -3888,   -401,   1075,
         -708,  -3990,   3046,  -6994,  -4337,   -802,   3294,  -3642,
          173,  -1664,   4025,  -9347,  -4625,   1068,  -2085,  -1417,
         2065,  -5360,   3726,  -3958,   2207,  -2149,  -4301,  -1155,
         3648,  -6210,  -5605,  -4962,   -584,   2924,  -2578,    653,
        -1991,   -365,  -5499,  -5845,  -3161,  -2623,   2687,  -3942,
        -1478,   4703,  -4371,   2317,   5832,     13,   -647,   3568,
        -1427,   1865,   4646,    -97,   1771,   3820,   6102,    -35,
         -684,   -243,  -4787,   -819,   2031,   1310,   1990,   4426,
         7081,  -2000,   4689,  -6318,  -3293,   2999,   5343,   3363,
         5959,  -1358,  -1579,   1719,  -4615,  -4943,   7214,   -486,
         -628,   3818,   6069,   4531,   6674,   4590,  -3078,   2361,
         7678,  -3030,   6019,   2501,   6549,    293,   5993,   9423,
        -3665,    903,  -3296,   2469,  -3289,   5000,  -2659,  -3402,
          767,  -1072,   4897,   1739,   4562,  -1888,   2220,   6091,
        -4127,   3011,   8940,   -106,  -4272,    -16,   3146,   2139,
        -2127,  -3652,  -1036,    359,   3224,  -4552,  -1246,  -1302,
         1459,  -4763,   1476,  -3087,   5401,   3114,   5780,  -4323,
          770,  -2384,  -4581,  -9684,  -3282,   4837,   2847,   5452,
         6987,    930,  -2099,    286,  -2741,   4538,   2958,   8893,
         2672,    855,   4625,   -245,  -1055,   1424,   4606,   -284,
        -2527,   3866,    755,  -8148,    -73,   6517,   -633,   7787,
         4584,    606,   -444,  -6078,   2683,  -3175,   3787,   4958,
        -2211,  -3110,   2888,   3520,   -972,    -90,  -7670,  -3211,
         5327,  -2271,  -3255,  -4101,  -3089,  -3578,  -5082,   3988,
         5361,   3782,   -395,  -3888,   -647,  -2509,   3353,   3898,
        -2259,   1484,   1921,    843,   3466,   2834,  -3208,   1094,
         2234,  -4657,   2601,  -2997,  -2387,   5305,  -5032,    157,
        -2514,   -740,   1155,  -2304,   2023,   4845,   -879,   4512,
        -5493,  -5054,   3612,   2794,  -5848,  -3098,  -1238,  -2079,
        -4738,  -3335,   -304,  -7464,   2746,   -692,  -5151,    689,
         1727,  -4281,   5624,  -1849,   2865,   2612,   2632,    337,
        -4440,   -460,  -3686,    520,   5451,     28,  -4457,  -2689,
          657,  -3089,  -4385,  -6330,  -3158,  -8233,  -7206,  -6108,
        -1699,   1406,  -3313,  -2157,  -1072,   -447,   6152,   4019,
         5332,  -4511,   3893,   1620,   3346,    385,   4568,  -1122,
         3211,  -4151,   3343,   -739,   -989,   -975,  -4835,    456,
        -9714,  -3320,  -4406,  -7235,  -1278,  -3262,  -4594,   -789,
         1830,  -5812,  -3510,  -2378,   2978,  -5201,   2394,  -8368,
         -805,   5844,   1959,  -1911,     62,  -5406,   2688,  -7846,
         4998,  -4609,  -3805,   5648,   5136,  -4078,  -2876,  -1770,
         3205,   4274,   4298,  -4266,   1935,  -1677,   4316,    829,
         5781,  -1320,  -4783,   3527,  -2729,   -812,    352,  -2073,
        -4716,  -2577,   2124,   2814,   3832,  -1776,   1273,   -160,
         2201,  -4304,  -2112,    650,  -2652,   4922,   5892,  -2477,
         4996,   5180,   5791,  -3246,   5057,  -1540,    649,  -1542,
         5356,   5511,  -2327,  -1458,   2595,   2481,   6113,   2090,
         4532,   2175,  -3601,  -1260,  -3252,  -2107,    748,   2289,
        -2570,    243,   2383,  -5119,  -5469,  -2400,   6677,   1268,
         4646,   5217,    836,  -3854,   -847,  -3641,   1609,   4722,
         -120,   4759,   1927,   2536,   -584,    410,   1200,   2344,
        -4022,   4299,  -1135,  -4561,   -204,    400,  -2596,   3046,
         1868,  -2990,  -1139,  -1350,     95,   3892,   2365,  -4131,
         3962,   4610,  -4341,   1685,    173,  -3556,  -4858,  -4184,
        -3275,   1557,    460,   2815,   3076,    368,  -2378,   1030,
        -2812,  -4952,   2604,  -1736,  -1434,   2835,    107,   -808,
        -5176,  -1606,   -956,    238,  -4969,    867,   1258,  -4262,
          274,   -902,   1392,   4296,  -4233,   1429,    -62,   2585,
        -1385,   3628,   2474,  -6079,   5374,   2406,  -5525,  -6237,
        -5529,   2618,  -2492,  -3323,    979,  -2242,  -6120,   -579,
         2766,   1544,   3183,  -7574,  -3184,   2723,  -5365,   1347,
         3680,   4491,   -696,    307,   4862,   3620,  -4893,   5288,
         -239,   -368,   1866,  -4810,   3062,  -3214,  -4184,   -754,
        -5546,  -4272,   -451,  -5241,      9,  -1096,   1250,  -4981,
         -495,   4871,  -3608,   1608,  -1405,   3495,  -2964,  -1746,
         2903,  -2005,  -1120,  -4693,  -2510,  -4554,   2105,  -5192,
        -1811,   4159,  -6911,  -8342,  -1711,  -4729,    996,   3879,
        -5114,   2984,   4037,  -4281,   -109,  -4493,   2654,   -996,
         2984,  -2251,   1753,   2508,   5174,   4747,    -12,  -4936,
         1425,  -4296,  -1884,  -3496,   5359,   2053,   1077,  -3050,
        -5228,   -306,   5173,   -461,    -98,    823,   2203,   3930,
         1496,  -4325,   5224,  -1732,   -810,   2752,   3156,   3268,
         4482,   1601,  -4753,   -437,   4858,   -757,  -3857,   1644,
        -4807,   3297,  -3812,   -821,   3718,   1486,  -2018,   1129,
         -559,   3016,  -2586,  -4521,   -363,    -34,  -3666,   1921,
         3162,  -5268,   3404,  -2817,   -538,   3708,   3046,  -5221,
        -5954,  -4773,   -157,  -6704,   3230,   2206,   3717,    605,
          876,   -809,  -1543,  -2601,  -2562,  -1154,  -2675,  -4442,
        -2383,  -2244,   6293,    951,  -3961,    994,    797,  -6482,
        -2394,   2144,   -757,  -3938,  -3705,   2406,   4748,  -4347,
        -4313,  -3593,  -5263,  -1318,   4329,    519,   3613,  -1978,
         -535,   1584,   4492,   -399,  -1442,   3289,  -4058,  -3561,
         3105,    853,   -676,  -6064,   2394,    107,   2664,   8727,
         2435,  -2668,  -3124,   4662,     62,   2965,   3774,  -3560,
         1902,  -2292,   1583,  -2936,  -1134,  -1269,    307,   5058,
        -2679,   2366,  -4518,  -9858,   5069,    555,   1821,  -4369,
          540,  -6313,   9331,   3095,   3785,  -5532,   2518,   4493,
        -5979,   1353,    934,      8,  -1809,   3520,   1068,   1199,
         -460,  -9231,  -3196,  -3575,  -2230,  -1184,  -3858,  -3099,
         7058,  -8097,    952,   3412,   1658,    263,   2564,   5282,
